package hometask22;



// а какие будут иметь общий функционал со всеми животными.
//        Сделайте метод say() абстрактным методом.
//
//
//        name (у домашних);
//        age(у всех животных);
//        weight(у всех животных);
//        color(у всех животных);
//        predator(у диких);
//
//        Методы:
//protected abstract say();
//
//        Остальные методы сделайте не абстрактными (с конкретной реализацией) исходя из вашего воображения
//        и требований ниже.
//
//        2. В приложении, издавать голос следующим образом :
//
//        возвращается строка,
//        у всех начинается “Hello, ” + :
//        если есть имя  “my name is <name>.”
//        если дикое “I am a wild animal”
//        если хищник “ and I am angry ”
//        если собака “Woof”
//        если кот “Meow”
//        рыбка отличается от всех и её реплика будет “....”.
//
//        3. Протестируйте ваше приложение создавая различных животных поочередно вызывая метод say() для каждого из
//        видов животных.
//        Проверьте результат согласно указанным требованиям в пункте 2.
//
//        4. Создайте класс Labrador в новом пакете animalworld
//        Реализуйте метод void loudSay()  и вызовите трижды protected-метод класса Dog.
//
//        Протестируйте и проверьте, что вызов метода loudSay() над объектом типа Labrador выведет трижды слово “Woof”.
public class Mainmain {
}
